app/Controllers/Auth.php

    public function login()
    {
        if (session('log_auth')) {
            return $this->redirectBack();
        }
        if (!$this->validate([
            'txtUsername' => 'required',
            'txtPassword' => 'required',
            'cmbRole' => 'required|in_list[Guru,Siswa,Ortu,Administrator]'
        ])) {
            return redirect()->to(base_url('auth'))->with('danger', 'Mohon isi data dengan lengkap!');
        }
        $role = $this->request->getPost('cmbRole');
        $username = $this->request->getPost('txtUsername');
        $password = base64_encode((string) $this->request->getPost('txtPassword'));
        if ($role == 'Guru') {
            $dtAkun = $this->modelGuru->where('username', $username)->first();
            $key = 'id_guru';
        } elseif ($role == 'Siswa') {
            $dtAkun = $this->modelSiswa->where('username', $username)->first();
---
SELECT *
FROM `siswa`
WHERE `username` = '5191'
 LIMIT 1