app/Controllers/ERaport.php

SELECT *
FROM `siswa`
WHERE `siswa`.`id` = '1'
SELECT *
FROM `nilai_non_akademik_detail`
JOIN `nilai_non_akademik` ON `nond_non_id`=`non_id`
JOIN `kelas` ON `id_kelas`=`non_kelas_id`
JOIN `semester` ON `id_semester`=`non_semester_id`
JOIN `tahun_ajaran` ON `semester`.`id_ta`=`id`
GROUP BY `id`
---
    public function tahun_ajaran()
    {
        if (session('log_auth')['role'] == 'SISWA') {
            $dtSiswa = $this->modelSiswa->find(session('log_auth')['akunID']);
        } elseif (session('log_auth')['role'] == 'ORTU') {
            $dtOrtu = $this->modelOrtu->find(session('log_auth')['akunID']);
            $dtSiswa = $this->modelSiswa->where('nis', $dtOrtu['nis_siswa'])->first();
        } else {
            return 'Access Dennied';
        }
        $dtTahun = $this->modelNilaiNonAkademikDetail
            ->join('nilai_non_akademik', 'nond_non_id=non_id')
            ->join('kelas', 'id_kelas=non_kelas_id')
            ->join('semester', 'id_semester=non_semester_id')
            ->join('tahun_ajaran', 'semester.id_ta=id')
            ->groupBy('id')->findAll();