app/Controllers/Guru.php

    public function index()
    {
        $data = [
            'title' => 'Siasmarigo',
            'sub_title' => 'Guru',
            'guru' => $this->ModelGuru->findAll()
---
SELECT *
FROM `guru`