app/Controllers/HasilBelajar.php

    public function index()
    {
        if (session('log_auth')['role'] == "GURU") {
            $dtTahun = $this->ModelJadwal->join('tahun_ajaran', 'jadwal.tahun_ajaran=id')
                ->where('guru_id', session('log_auth')['akunID'])
                ->groupBy('jadwal.tahun_ajaran')
                ->findAll();
            $dtKelas = $this->ModelJadwal->select('kelas_id as idKelas, nama_kelas as namaKelas, tahun_ajaran as idTahunAjaran')
                ->where('guru_id', session('log_auth')['akunID'])
                ->join('kelas', 'kelas_id=id_kelas')
                ->groupBy('kelas_id')
                ->findAll();
        } elseif (session('log_auth')['role'] == "SISWA") {
            $dtTahun = $this->ModelNilaiAkademik->join('kategori_tugas', 'na_kategori_id=kt_id')
                ->join('jadwal', 'kt_jadwal_id=jadwal_id')
                ->join('kelas', 'kelas_id=id_kelas')
                ->join('tahun_ajaran', 'tahun_ajaran.id=jadwal.tahun_ajaran')
                ->where('na_siswa_id', session('log_auth')['akunID'])
                ->groupBy('kelas_id')
                ->findAll();
        } elseif (session('log_auth')['role'] == "ORTU") {
            $dtAkun = $this->ModelOrtu->select('siswa.id as siswaID')->join('siswa', 'nis_siswa=nis')->where('id_orangtua', session('log_auth')['akunID'])->first();
            $dtTahun = $this->ModelNilaiAkademik->join('kategori_tugas', 'na_kategori_id=kt_id')
                ->join('jadwal', 'kt_jadwal_id=jadwal_id')
                ->join('kelas', 'kelas_id=id_kelas')
                ->join('tahun_ajaran', 'tahun_ajaran.id=jadwal.tahun_ajaran')
                ->where('na_siswa_id', $dtAkun['siswaID'])
                ->groupBy('kelas_id')
                ->findAll();
---
SELECT *
FROM `nilai_akademik`
JOIN `kategori_tugas` ON `na_kategori_id`=`kt_id`
JOIN `jadwal` ON `kt_jadwal_id`=`jadwal_id`
JOIN `kelas` ON `kelas_id`=`id_kelas`
JOIN `tahun_ajaran` ON `tahun_ajaran`.`id`=`jadwal`.`tahun_ajaran`
WHERE `na_siswa_id` = '1'
GROUP BY `kelas_id`
SELECT `siswa`.`id` as `siswaID`
FROM `orangtua`
JOIN `siswa` ON `nis_siswa`=`nis`
WHERE `id_orangtua` = '6'
 LIMIT 1

    public function mapel($idTahunAjaran, $idKelas = 0)
    {
        $dtTA = $this->ModelTahunAjar->find($idTahunAjaran);
        if (empty($dtTA)) {
            session()->setFlashdata('danger', 'Data tahun ajaran tidak ditemukan');
            return $this->redirectBack();
        }
        if (session('log_auth')['role'] == "GURU") {
            if ($idKelas == 0) {
                session()->setFlashdata('danger', 'Mohon pilih kelas terlebih dahulu');
                return $this->redirectBack();
            }
            $dtMapel = $this->ModelJadwal->join('matapelajaran', 'mapel_id=matapelajaran.id')
                ->where('guru_id', session('log_auth')['akunID'])
                ->where('tahun_ajaran', $idTahunAjaran)
                ->where('kelas_id', $idKelas)
                ->groupBy('mapel_id')->findAll();
            session()->set('idKelasForHasil', $idKelas);
        } elseif (session('log_auth')['role'] == "SISWA") {
            $dtMapel = $this->ModelNilaiAkademik->join('kategori_tugas', 'na_kategori_id=kt_id')
                ->join('jadwal', 'kt_jadwal_id=jadwal_id')
                ->join('matapelajaran', 'mapel_id=matapelajaran.id')
                ->where('na_siswa_id', session('log_auth')['akunID'])
                ->where('jadwal.tahun_ajaran', $idTahunAjaran)
                ->groupBy('mapel_id')
                ->findAll();
        } elseif (session('log_auth')['role'] == "ORTU") {
            $dtAkun = $this->ModelOrtu->select('siswa.id as siswaID')->join('siswa', 'nis_siswa=nis')->where('id_orangtua', session('log_auth')['akunID'])->first();
            $dtSiswa = $this->ModelSiswa->find($dtAkun['siswaID']);
            $dtMapel = $this->ModelNilaiAkademik->join('kategori_tugas', 'na_kategori_id=kt_id')
                ->join('jadwal', 'kt_jadwal_id=jadwal_id')
                ->join('matapelajaran', 'mapel_id=matapelajaran.id')
                ->where('na_siswa_id', $dtAkun['siswaID'])
                ->where('jadwal.tahun_ajaran', $idTahunAjaran)
                ->groupBy('mapel_id')
                ->findAll();
---
SELECT `siswa`.`id` as `siswaID`
FROM `orangtua`
JOIN `siswa` ON `nis_siswa`=`nis`
WHERE `id_orangtua` = '6'
 LIMIT 1
SELECT *
FROM `siswa`
WHERE `siswa`.`id` = '1'
SELECT *
FROM `nilai_akademik`
JOIN `kategori_tugas` ON `na_kategori_id`=`kt_id`
JOIN `jadwal` ON `kt_jadwal_id`=`jadwal_id`
JOIN `matapelajaran` ON `mapel_id`=`matapelajaran`.`id`
WHERE `na_siswa_id` = '1'
AND `jadwal`.`tahun_ajaran` = '8'
GROUP BY `mapel_id`

    public function hasil($idTahunAjaran, $idMapel, $semester = 0, $keterangan = null)
    {
        $dtTA = $this->ModelTahunAjar->find($idTahunAjaran);
        if (empty($dtTA)) {
            session()->setFlashdata('danger', 'Data tahun ajaran tidak ditemukan');
            return $this->redirectBack();
        }
        if ($semester == 0) {
            $dtSmt = $this->ModelSemester->where('id_ta', $dtTA['id'])->first();
---
SELECT *
FROM `semester`
WHERE `id_ta` = '8'
 LIMIT 1

                    $dtNilai[$dt['kt_id']] = null;
                }
            }
            $dtSiswa = $this->ModelSiswa->find(session('log_auth')['akunID']);
        } elseif (session('log_auth')['role'] == "ORTU") {
            $dtAkun = $this->ModelOrtu->select('siswa.id as siswaID')->join('siswa', 'nis_siswa=nis')->where('id_orangtua', session('log_auth')['akunID'])->first();
            $dtSiswa = $this->ModelSiswa->find($dtAkun['siswaID']);
            $dtNilai = [];
            foreach ($dtKategori as $dt) {
                $tmp = $this->ModelNilaiAkademik->where('na_kategori_id', $dt['kt_id'])->where('na_siswa_id', $dtAkun['siswaID'])->first();
---
SELECT *
FROM `siswa`
WHERE `siswa`.`id` = '1'
SELECT `siswa`.`id` as `siswaID`
FROM `orangtua`
JOIN `siswa` ON `nis_siswa`=`nis`
WHERE `id_orangtua` = '6'
 LIMIT 1
SELECT *
FROM `nilai_akademik`
WHERE `na_kategori_id` = '1'
AND `na_siswa_id` = '1'
 LIMIT 1

            'mapelID' => $idMapel,
            'dtTA' => $dtTA,
            'jenisKategori' => strtolower($keterangan),
            'listSemester' => $this->ModelSemester->where('id_ta', $dtTA['id'])->findAll(),
---
SELECT *
FROM `semester`
WHERE `id_ta` = '8'