app/Controllers/HasilBelajar.php

SELECT *
FROM `jadwal`
JOIN `matapelajaran` ON `id` = `mapel_id`
JOIN `kelas` ON `kelas_id`=`id_kelas`
WHERE `mapel_id` = '9'
AND `tahun_ajaran` = '8'
 LIMIT 1
---
                return $this->redirectBack();
            }
        }
        $dtMapel = $this->ModelJadwal->join('matapelajaran', 'id = mapel_id')
            ->join('kelas', 'kelas_id=id_kelas')
            ->where('mapel_id', $idMapel)
            ->where('tahun_ajaran', $idTahunAjaran);