app/Controllers/Home.php

SELECT *
FROM `user`
WHERE `id` = '4'
SELECT *
FROM `siswa`
WHERE `id` = '1'
SELECT *
FROM `pengumuman`
---
    public function index()
    {
        if (session('log_auth')['role'] == 'ADMINISTRATOR') {
            $data_akun = $this->db->table('user')->where('id', session('log_auth')['akunID'])->get()->getResultArray();
        }
        if (session('log_auth')['role'] == 'GURU') {
            $data_akun = $this->db->table('guru')->where('id_guru', session('log_auth')['akunID'])->get()->getResultArray();
        }
        if (session('log_auth')['role'] == 'SISWA') {
            $data_akun = $this->db->table('siswa')->where('id', session('log_auth')['akunID'])->get()->getResultArray();
        }
        if (session('log_auth')['role'] == 'ORTU') {
            $data_akun = $this->db->table('orangtua')->where('id_orangtua', session('log_auth')['akunID'])->get()->getResultArray();
        }

        $data = [
            'title' => 'Siasmarigo',
            'sub_title' => 'Dashboard',
            'pengumuman' => $this->ModelPengumuman->findAll(),