app/Controllers/Mapel.php

SELECT *
FROM `guru`
---
    public function index()
    {
        $data = [
            'title' => 'Siasmarigo',
            'sub_title' => 'Mata Pelajaran',
            'mapel' => $this->ModelMapel->getDataMapel(),
            'semester' => $this->ModelSemester->getDataSmt(),
            'guru' => $this->ModelGuru->findAll(),