app/Controllers/Ortu.php

SELECT *
FROM `siswa`
---
    public function index()
    {
        $data = [
            'title'     => 'Siasmarigo',
            'sub_title' => 'Data Orang Tua',
            'siswa'     => $this->ModelSiswa->findAll(),
            'ortu'      => $this->ModelOrtu->findAll(),
        ];

UPDATE `orangtua` SET `username` = 'luism', `nama` = 'Luis Maryadi', `no_hp` = '0827625273', `pekerjaan` = 'Karyawan swasta', `nis_siswa` = '5191', `alamat` = 'Sleman', `password` = 'MTIzNA=='
WHERE `orangtua`.`id_orangtua` IN ('6')
---
    public function editData($id_orangtua)
    {
        $data = [
            'username'  => $this->request->getPost('username'),
            'nama'      => $this->request->getPost('nama'),
            'no_hp'     => $this->request->getPost('no_hp'),
            'pekerjaan' => $this->request->getPost('pekerjaan'),
            'nis_siswa' => $this->request->getPost('nis_siswa'),
            'alamat'    => $this->request->getPost('alamat'),
        ];
        if (trim((string)$this->request->getPost('password')) != '') {
            $data['password'] = base64_encode((string)$this->request->getPost('password'));
        };
        $this->ModelOrtu->update($id_orangtua, $data);