app/Controllers/Siswa_profil.php

    public function index()
    {
        $id_siswa = session('log_auth')['akunID'];
        $data = [
            'title' => 'Siasmarigo',
            'sub_title' => 'Profil Siswa',
            'dt_siswa'   => $this->ModelSiswa->where('id', $id_siswa)->first()
---
SELECT *
FROM `siswa`
WHERE `id` = '1'
 LIMIT 1