app/Controllers/Siswa.php

    public function index()
    {
        $data = [
            'title' => 'Siasmarigo',
            'sub_title' => 'Siswa',
            'siswa' => $this->ModelSiswa->findAll(),
            'kelas' => $this->ModelKelas->findAll(),
---
SELECT *
FROM `siswa`
SELECT *
FROM `kelas`

    public function insertData()
    {
        $file = $this->request->getFile('photo');
        $nama_file = $file->getRandomName();
        $data = [
            'nis' => $this->request->getPost('nis'),
            'username' => $this->request->getPost('username'),
            'password' => md5((string)$this->request->getPost('password')),
            'nama' => $this->request->getPost('nama'),
            'tempat_lahir' => $this->request->getPost('tempat_lahir'),
            'tgl_lahir' => $this->request->getPost('tgl_lahir'),
            'gender' => $this->request->getPost('gender'),
            'no_hp' => $this->request->getPost('no_hp'),
            'email' => $this->request->getPost('email'),
            'alamat' => $this->request->getPost('alamat'),
            'photo' => $nama_file,
        ];
        $file->move('foto_siswa/', $nama_file);
        $this->ModelSiswa->insert($data);
---
INSERT INTO `siswa` (`nis`, `username`, `password`, `nama`, `tempat_lahir`, `gender`, `no_hp`, `alamat`, `photo`) VALUES ('51901', 'haris', 'd1a6f896a111b237d8ff8dc4ac623809', 'haris nganu', 'semarang', 'Laki-laki', '093843171', 'yogyakarta', '1679841888_eb85ce5d7ba5d79d0bb6.png')