app/Models/ModelKelas.php

SELECT *
FROM `kelas`
JOIN `tahun_ajaran` ON `tahun_ajaran`.`id`=`kelas`.`id_ta`
---
    public function getDataKelas()
    {
        return $this->db->table('kelas')
            ->join('tahun_ajaran', 'tahun_ajaran.id=kelas.id_ta')
            ->get()->getResultArray();