app/Models/ModelMapel.php

SELECT *
FROM `matapelajaran`
JOIN `semester` ON `semester`.`id_semester`=`matapelajaran`.`id_semester`
JOIN `guru` ON `guru`.`id_guru`=`matapelajaran`.`id_guru`
---
    public function getDataMapel()
    {
        return $this->db->table('matapelajaran')
            ->join('semester', 'semester.id_semester=matapelajaran.id_semester')
            ->join('guru', 'guru.id_guru=matapelajaran.id_guru')
            ->get()->getResultArray();