app/Models/ModelSemester.php

SELECT *
FROM `semester`
JOIN `tahun_ajaran` ON `tahun_ajaran`.`id`=`semester`.`id_ta`
---
    public function getDataSmt()
    {
        return $this->db->table('semester')
            ->join('tahun_ajaran', 'tahun_ajaran.id=semester.id_ta')
            ->get()->getResultArray();